stressTesting/stress2.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 240
      arrivalRate: 50
      rampTo: 800
      name: "serve 'em up"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
  payload: 
    path: "dummyTickers.csv"
    fields:
      - "ticker"
scenarios:
  - flow:
    - get:
        url: "/{{ticker}}"