stressTesting/stress2.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 120
      arrivalRate: 50
      rampTo: 800
      name: "Get and POST"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
  payload: 
    path: "dummyTickers.csv"
    fields:
      - "ticker"
scenarios:
  - flow:
    - get:
        url: "http://localhost:5000/api/stocks/{{ticker}}"